; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v9)
             (pred_2 ?v6 ?v3)
             (pred_6 ?v2 ?v3)
             (pred_4 ?v4 ?v2 )
	     (pred_3 ?v2)
             (pred_1 ?v1)
             (pred_8 ?v6)
             (pred_12 ?v3)
             (pred_5 ?v2)
             (pred_10 ?v6)
             (pred_11 ?v2)
             (pred_7 ))



(:action op_1
:parameters (?v10 ?v11 ?v13 ?v7)
:precondition (and (pred_1 ?v10) (pred_1 ?v11) (pred_8 ?v13) (pred_12 ?v7)
          (pred_9 ?v10 ?v11) (pred_2 ?v13 ?v7)
                   (pred_6 ?v11 ?v7) (pred_3 ?v10) 
                   (pred_5 ?v11) (pred_10 ?v13))
:effect (and  (pred_11 ?v11) (not (pred_5 ?v11))))


(:action op_5
:parameters (?v10 ?v5)
:precondition (and (pred_1 ?v10) (pred_1 ?v5)
               (pred_3 ?v10) (pred_9 ?v10 ?v5) (pred_11 ?v5))
:effect (and (pred_3 ?v5) (not (pred_3 ?v10))))

(:action op_3
:parameters (?v10 ?v13)
:precondition (and (pred_1 ?v10) (pred_8 ?v13) 
                  (pred_3 ?v10) (pred_4 ?v13 ?v10) (pred_7 ))
:effect (and (pred_10 ?v13)
   (not (pred_4 ?v13 ?v10)) (not (pred_7 ))))


(:action op_2
:parameters (?v10 ?v8 ?v12)
:precondition (and (pred_1 ?v10) (pred_8 ?v8) (pred_8 ?v12)
                  (pred_3 ?v10) (pred_10 ?v12) (pred_4 ?v8 ?v10))
:effect (and (pred_10 ?v8) (pred_4 ?v12 ?v10)
        (not (pred_10 ?v12)) (not (pred_4 ?v8 ?v10))))

(:action op_4
:parameters (?v10 ?v13)
:precondition (and (pred_1 ?v10) (pred_8 ?v13) 
                  (pred_3 ?v10) (pred_10 ?v13))
:effect (and (pred_7 ) (pred_4 ?v13 ?v10) (not (pred_10 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_13 obj_07 obj_26 obj_21 obj_17 obj_28 obj_10 obj_19 obj_25 obj_27 obj_23 obj_08 obj_03 obj_22 obj_24 obj_16 obj_09 obj_20 obj_01 obj_14 obj_15 obj_29 obj_04 obj_02
    obj_18 obj_06 obj_11
    obj_05 obj_31 obj_30
    )

    (:init
       (pred_7)

       (pred_1 obj_12)
       (pred_1 obj_13)
       (pred_1 obj_07)
       (pred_1 obj_26)
       (pred_1 obj_21)
       (pred_1 obj_17)
       (pred_1 obj_28)
       (pred_1 obj_10)
       (pred_1 obj_19)
       (pred_1 obj_25)
       (pred_1 obj_27)
       (pred_1 obj_23)
       (pred_1 obj_08)
       (pred_1 obj_03)
       (pred_1 obj_22)
       (pred_1 obj_24)
       (pred_1 obj_16)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_1 obj_01)
       (pred_1 obj_14)
       (pred_1 obj_15)
       (pred_1 obj_29)
       (pred_1 obj_04)
       (pred_1 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_06)
       (pred_12 obj_11)
       (pred_8 obj_05)
       (pred_8 obj_31)
       (pred_8 obj_30)

       (pred_9 obj_12 obj_17)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_13 obj_28)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_26)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_26 obj_19)
       (pred_9 obj_26 obj_21)
       (pred_9 obj_26 obj_07)
       (pred_9 obj_21 obj_25)
       (pred_9 obj_21 obj_26)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_17 obj_28)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_28 obj_23)
       (pred_9 obj_28 obj_10)
       (pred_9 obj_28 obj_13)
       (pred_9 obj_28 obj_17)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_28)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_19 obj_26)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_25 obj_22)
       (pred_9 obj_25 obj_21)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_27 obj_24)
       (pred_9 obj_27 obj_23)
       (pred_9 obj_27 obj_17)
       (pred_9 obj_23 obj_16)
       (pred_9 obj_23 obj_08)
       (pred_9 obj_23 obj_28)
       (pred_9 obj_23 obj_27)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_23)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_03 obj_22)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_22 obj_01)
       (pred_9 obj_22 obj_25)
       (pred_9 obj_22 obj_03)
       (pred_9 obj_24 obj_14)
       (pred_9 obj_24 obj_16)
       (pred_9 obj_24 obj_27)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_16 obj_23)
       (pred_9 obj_16 obj_24)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_09 obj_20)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_09)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_22)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_24)
       (pred_9 obj_15 obj_29)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_29 obj_04)
       (pred_9 obj_29 obj_09)
       (pred_9 obj_29 obj_15)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_29)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_04)
       (pred_5 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_27)
       (pred_6  obj_16 obj_18)
       (pred_6  obj_13 obj_06)
       (pred_6  obj_27 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_07)
       (pred_11 obj_26)
       (pred_11 obj_21)
       (pred_11 obj_17)
       (pred_11 obj_28)
       (pred_11 obj_10)
       (pred_11 obj_19)
       (pred_11 obj_25)
       (pred_11 obj_23)
       (pred_11 obj_08)
       (pred_11 obj_03)
       (pred_11 obj_22)
       (pred_11 obj_24)
       (pred_11 obj_09)
       (pred_11 obj_20)
       (pred_11 obj_01)
       (pred_11 obj_14)
       (pred_11 obj_15)
       (pred_11 obj_29)
       (pred_11 obj_04)
       (pred_11 obj_02)

       (pred_2  obj_05 obj_18)
       (pred_2  obj_31 obj_06)
       (pred_2  obj_30 obj_11)
       (pred_4 obj_05 obj_22)
       (pred_4 obj_31 obj_29)
       (pred_4 obj_30 obj_23)
       (pred_3 obj_10)
    )

    (:goal (and
       (pred_4 obj_05 obj_03)
       (pred_4 obj_30 obj_03)
    ))
(:constraints
  (always (not (pred_3 obj_08)))
)
)

; plan
1. (op_5 obj_10 obj_28)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_28)
   goals met: 0 of 2
2. (op_5 obj_28 obj_23)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_23)
   goals met: 0 of 2
3. (op_3 obj_23 obj_30)
   deleted: (pred_4 obj_30 obj_23) (pred_7)
   added: (pred_10 obj_30)
   goals met: 0 of 2
4. (op_5 obj_23 obj_28)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_28)
   goals met: 0 of 2
5. (op_5 obj_28 obj_10)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_10)
   goals met: 0 of 2
6. (op_5 obj_10 obj_19)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_19)
   goals met: 0 of 2
7. (op_5 obj_19 obj_03)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_03)
   goals met: 0 of 2
8. (op_4 obj_03 obj_30)
   deleted: (pred_10 obj_30)
   added: (pred_7) (pred_4 obj_30 obj_03)
   goals met: 1 of 2
9. (op_5 obj_03 obj_22)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_22)
   goals met: 1 of 2
10. (op_3 obj_22 obj_05)
   deleted: (pred_4 obj_05 obj_22) (pred_7)
   added: (pred_10 obj_05)
   goals met: 1 of 2
11. (op_5 obj_22 obj_03)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_03)
   goals met: 1 of 2
12. (op_4 obj_03 obj_05)
   deleted: (pred_10 obj_05)
   added: (pred_7) (pred_4 obj_05 obj_03)
   goals met: 2 of 2
